
<p> 12.PHP-скрипт, в котором вычисляется значение заданного выражения (4*c-(d/2))/((a^2)-1)
    для случайных аргументов из интервала [-20, 20]:
<p>
    <?php
    $a = rand(-20, 20);
    $d = rand(-20, 20);
    $c = rand(-20, 20);
    echo('a =' . $a);
    echo('<br> d =' . $d);
    echo('<br> c =' . $c);
    echo('<br>');
    echo('(4*c-(d/2))/((a^2)-1) =' . (4*$c-($d/2))/(POW($a, 2) - 1) . '<br>');
    ?>
    <p> 2.PHP-скрипт, в котором вычисляется значение заданного выражения (2*c-d/23)/(1-a/3)
    для случайных аргументов из интервала [-20, 20]:
<p>
    <?php
    $a = rand(-20, 20);
    $d = rand(-20, 20);
    $c = rand(-20, 20);
    echo('a =' . $a);
    echo('<br> d =' . $d);
    echo('<br> c =' . $c);
    echo('<br>');
    echo('(2*c-d/23)/(1-a/3) =' . (2*$c-$d/23)/(1-$a/3) . '<br>');
    ?>